---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs
source: html/9ae8d92e-b98b-e782-3b7a-ca274b7ec926.htm
---
# ViewsExportingByContextEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.